Revit 2027 API
ElectricalLoadClassification.Abbreviation Property
 The abbreviation of the load classification name
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Abbreviation { get; set; }
Public Property Abbreviation As String
	Get
	Set
public:
property String^ Abbreviation {
	String^ get ();
	void set (String^ value);
}
member Abbreviation : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: abbreviation is an empty string or contains only whitespace.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace